---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationAbbreviation(System.Int32)
source: html/807829a2-4ad2-41ea-cf60-e125d7693dfe.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationAbbreviation Method

Gets insulation specification abbreviation.

## Syntax (C#)
```csharp
public string GetInsulationSpecificationAbbreviation(
	int insulationSpecificationId
)
```

## Parameters
- **insulationSpecificationId** (`System.Int32`) - The insulation specification identifier.